app/Controllers/Auth.php

SELECT *
FROM `tbl_users`
WHERE `email` = 'mwelujenny@gmail.com'
 LIMIT 1
---
    function check(){
        //Let's start validation
        $validation = $this->validate([
            'email'=> [
                'rules'=> 'required|valid_email|is_not_unique[tbl_users.email]',
                'errors'=> [
                    'required'=> 'Email is required',
                    'valid_email'=> 'Enter a valid email address',
                    'is_not_unique'=> 'This email is not registered in our system'
                ]
                ],
            'password'=> [
                'rules'=> 'required|min_length[5]|max_length[12]',
                'errors'=> [
                    'required'=> 'Password is required',
                    'min_length'=> 'Password must have atleast 5 characters',
                    'max_length'=> 'Password must have a maximum of 12 characters'
                ]
            ]
        ]);

        if(!$validation){
            return view('auth/login', ['validation'=>$this->validator]);
        }else{
            //let's check user

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $usersModel = new \App\Models\UsersModel();
            $user_info = $usersModel->where('email', $email)->first();

UPDATE `tbl_users` SET `user_name` = 'Pollpall x', `email` = 'mwelujenny@gmail.com', `password` = '$2y$10$gnGje0mspU8sl.lqQmxyluy8dOa6Gzf90nYpKxfPN/YNILCLQigU.', `active` = '0', `remember_token` = NULL, `activation_code` = '7bb0538174971c167328586843e6a654', `remember_email` = NULL, `remember_password` = NULL
WHERE `tbl_users`.`user_id` IN ('24')
---
                    $user_info['remember_token'] = null;
                    $user_info['remember_email'] = null;
                    $user_info['remember_password'] = null;
                    $usersModel->update($user_info['user_id'], $user_info);

SELECT *
FROM `tbl_users`
WHERE `email` = 'mwelujenny@gmail.com'
 LIMIT 1
---
    public function send_reset_link()
{
    // Load the necessary helpers and libraries
    helper('form');
    helper('url');
    helper('email');

    // Validate the email address
    $validationRules = [
        'email' => 'required|valid_email',
    ];

    if (!$this->validate($validationRules)) {
        return redirect()->back()->with('failed', 'Please provide a valid email address.');
    }

    // Get the email entered by the user
    $emailAddress = $this->request->getPost('email');

    // Check if the email exists in the database
    $usersModel = new \App\Models\UsersModel();
    $user = $usersModel->where('email', $emailAddress)->first();